# -**- mode: org -**-
# -**- coding: utf-8 -**-
#+SETUPFILE: ./template_headers.org
#+STARTUP: overview
#+TITLE: NOTES - TITLE
#+SUBTITLE: By [WHO]
#+AUTHOR: [ME]
#+DATE: Starts [2023-03-14 Tue] - Ends [C-x C-!]
#+LANGUAGE: en
# #+PROPERTY: header-args :eval never-export
# #### :session  :exports both

#+TAGS: [ computational_thinking : math(m) ai ml data cybersecurity linux clean_code ]
#+TAGS: [ programming_language : c c++ python3 JavaScript bash common_lisp ]
#+TAGS: BUG(b)

#+SEQ_TODO: TODO(t) LEARNING(l!) WAIT(w@/!) | Done(d!) CANCELED(c@)

* How to build pomodoro timer application Javascript?

[[https://platform.openai.com/overview][OpenAI API Chat Beta]]

A basic overview of the steps involved:

1. Start by planning your application's user interface (UI). This should
  include a timer display, buttons to start and stop the timer, and any other
  settings you want to include (such as session length, break length, etc.).
2. Set up your HTML file with the necessary elements, such as the timer display
   and the buttons.
3. Write the JavaScript code to handle the timer functionality. This will
   involve using the `setInterval()` method to update the timer display at
   regular intervals, and handling user input to start and stop the timer.
4. Add any additional features you want, such as settings to adjust the session
   and break lengths, sound notifications when the timer ends, etc.


#+begin_src js :exports both :results output
var util = require("util");

console.log("this is a Node.js test program!");
#+end_src

#+RESULTS:
: this is a Node.js test program!

#+begin_src js :exports both :results output
console.log("Hello world!");
#+end_src

#+RESULTS:
: Hello world!

